# BuiltInFailures.BeamFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BeamFailures Class
BuiltInFailures Class Members See Also
---
Failures about Beams.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class BeamFailures
```

Visual Basic
---
```text
Public NotInheritable Class BeamFailures
```

Visual C++
---
```text
public ref class BeamFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..BeamFailures
# See Also
BuiltInFailures..::..BeamFailures Members
Autodesk.Revit.DB Namespace